{"name":"Angel Locsin","joinedDate":"Joined July 2009","birthDate":"Born April 23","bio":"","location":"Republic of the Philippines :)","followers":"11.7M","following":"497","tweets":[{"time":"4 Dec 2019","text":"I never thought  would ever mention my name, lol. Thank you! Filipinos have always been known for “bayanihan”. I’m nowhere near from being a billionaire, but I try my best to do my part in my own little way. I hope this would inspire other people to help as well."},{"time":"Mar 19","text":"South Korea has set up 'phone booths' that can test people for the  in just 7 minutes. The country has earned praise for its mass testing amid the  pandemic."},{"time":"Mar 20","text":"Hi guys.. anyone na kayang na kayang magpahatid ng PPE’s sa Catanduanes?"},{"time":"Mar 20","text":"Maraming salamat po!"},{"time":"Mar 20","text":"Hi everyone!   and I, understand that life is hard right now, so we’ll refrain from asking you for financial donations. Instead, we would like to ask you for stuff that you already have. \n\nWe,…"},{"time":"Mar 19","text":"Please donate & share"},{"time":"Mar 19","text":"Please donate and help spread the word"},{"time":"Mar 18","text":"My team is now finalizing mechanisms for donations, trying to get more supplies, & finding more ways to deliver the help that is needed. We'll be posting more details regarding our initiative via my Twitter, Facebook, & Instagram pages. Stay tuned & keep safe!"},{"time":"Mar 18","text":"For anyone else who has the heart to share, we encourage you to join our cause! All of our donations will go to vulnerable families in various barangays during the quarantine period. If we can give them enough supplies, they won’t have to leave the house & risk getting sick."},{"time":"Mar 16","text":"Dear health workers/anyone whose work isn't suspended today:\n\nIf you need a ride, please reply to this thread with  and your route.\n\nIf you're a private citizen w/ car whose willing to drop them off, check hashtag to see you can accommodate someone.\n\nLet's do this."},{"time":"Mar 18","text":"Finally! Thank you @BureauOfCustomsPH"},{"time":"Mar 18","text":"Akin lang ang asawa ko. Bow"},{"time":"Mar 17","text":"The hits you love and missed are back at dahil these days, the legal thing to do is to stay at home and believe in miracles, mapapanuod mo na muli ang  starting March 23 at 3:25PM at , 4:15PM!"},{"time":"Mar 17","text":"Hello everyone! Anyone na may contact sa seller ng impervious disposable gown wrap around  & splash shield face mask? Thank you!"},{"time":"Mar 16","text":"Thank you PhilHealth"},{"time":"Mar 16","text":"Sad but true. May nag iipit sa ports. Tapos ngayon people need to shell out so much money for masks that used to cost Php 45 per box, N95 used to be php 45 per piece (Bambang price). Umiiral ang pagiging madamot sa panahon na dapat nagtutulungan."},{"time":"Mar 16","text":"Sa nagbebenta sa akin ng mask na nakalaan para sa mga frontliners natin for P1,500, MAKONSENSIYA HO KAYO"},{"time":"Mar 16","text":"Hygiene and a healthy immune system are our best weapons against this viral war. Keep your hands clean and your body healthy"},{"time":"Mar 16","text":"Sir, many wanted to donate mask and other protective gears. Kaya lang sobrang difficult makakuha. Kung sakali mang natuloy yung order, may kukuha na politicians or big companies. I’m sure itutulong rin naman po nila sa iba. Pero it’s hard for us"},{"time":"Mar 16","text":"My thoughts: \n\nSa gitna po ng paglaganap ng CoVid19, walang sinoman na nasa matinong pag-iisip ang magnanais na lumabas sa matataong lugar para mahawa at makahawa ng sakit. Alam natin na importante ang social…"},{"time":"Mar 16","text":"Help our health workers. STAY HOME. Spend time with your fur babies"}]}