{"name":"MAJA","joinedDate":"Joined October 2009","birthDate":"Born October 5, 1988","bio":"","location":"manila","followers":"1.87M","following":"423","tweets":[{"time":"17h17 hours ago","text":"To every doctor, nurse medical staff, hospital staff, to everyone still going to work to provide basic goods, THANK YOU. Know that we are GRATEFUL FOR YOU and today and every day we pray for you and your safety and health."},{"time":"Mar 19","text":"Patients can now expect results in just 1.5-2 hours."},{"time":"Mar 19","text":"If possible, It’d be nice for companies, organizations or sports leagues to cancel the big events they have planned for the year and just donate the budget to those affected by the  Perfect time to show that money is not just for entertainment, but also for humanity"},{"time":"Mar 19","text":"To all businessmen who may not earn for a while because of this  crisis... what’s important is that we’re earning more generations ahead of us."},{"time":"Mar 16","text":"Senator Manny Pacquiao announced on Instagram that Chinese billionaire Jack Ma’s foundation in partnership with his foundation will donate 50,000 testing kits to combat the COVID-19 in the Philippines. (Instagram/Manny Pacquiao)"},{"time":"Mar 16","text":"MAY BUKAS PA!   napapanuod ulit ngayon sa primetime bida!"},{"time":"Mar 12","text":"Best effort tayong lahat to stay healthy and keep immune system up by eating well, getting some sun and movement daily. Regular hand washing. Avoiding crowded places. And when feeling sick, just stay home to heal because we need our full immunity at this time."},{"time":"Mar 12","text":"For our deaf brothers and sisters.\n\nTopic: COVID-19"},{"time":"Mar 12","text":"Are foreigners from countries with COVID-19 cases restricted to enter just Metro Manila or the whole Philippines? Coz there are direct international flights to other cities outside NCR like Cebu and Clark."},{"time":"Mar 7","text":"TikTok pa more!!!!"},{"time":"Feb 29","text":"Basketball Vlog with my cousin Stanley Pringle. kasama rin si \nand"},{"time":"Feb 23","text":"WATCH: Opening remarks of ABS-CBN President and CEO Carlo Katigbak during the Senate hearing."},{"time":"Feb 22","text":"lam niyo na ha"},{"time":"Feb 20","text":"Mensahe ni ABS-CBN Corp. President and CEO Carlo L. Katigbak. | Pebrero 20, 2020"},{"time":"Feb 17","text":"This is it!!!!  Manuod tayo sa Sabado!!!"},{"time":"Feb 14","text":"Happy Valentine's Day"},{"time":"Feb 12","text":"Emma and Elias pls bwahahahah"},{"time":"Feb 2","text":"43 AND 50!!!"}]}